rottenpotatoes/app/controllers/movies_controller.rb

  def similar_movies
    movie = Movie.find(params[:id])

    if movie.director.nil? || movie.director.empty?
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" IS NULL LIMIT 1